{"basics":{"name":"Alireza Ghazanfari","label":"Computer Science Student","email":"alireza79.ghazanfari@gmail.com"},"work":[{"name":"Gapify","position":"Software Engineer","url":"https://gapify.ai/","startDate":"2024-08-01","endDate":"Present","summary":"As a fillstack developer, I am working on tools, languages, and frameworks like Kotlin, Spring Boot, Ruby, Rails, React, Vue, Postgres, and Redis to create and maintain software based on generative AI concepts and agentic architectures.","highlights":["Relativity"]},{"name":"Digikala","position":"Software Engineer","url":"https://www.digikala.com/","startDate":"2022-07-01","endDate":"2023-02-28","summary":"As a backend developer, I gained valuable experience in Agile and Scrum methodologies while utilizing tools like Docker, Kubernetes, and Jira. During my role on the Promotions and Pricing team, I worked with PHP, Symfony, Redis, and Memcached.",},{"name":"Yektanet","position":"Software Engineer","url":"https://www.yektanet.com/","startDate":"2021-02-01","endDate":"2021-10-01","summary":"As a backend developer, I gained invaluable experience working with various tools and frameworks such as PostgreSQL, Celery, Django, REST API, and Nginx, as well as developing Telegram bots in Python.",}],"volunteer":[{"organization":"People's Climate March","location":"Zurich, Switzerland","position":"Lead Organizer","url":"https://example.com","startDate":"2014-04-01","endDate":"2015-07-01","summary":"Lead organizer for the New York City branch of the People's Climate March, the largest climate march in history.","highlights":["Awarded 'Climate Hero' award by Greenpeace for my efforts organizing the march.","Men of the year 2014 by Time magazine"]}],"education":[{"institution":"Sharif University of Technology, Tehran, Iran","location":"Tehran, Iran","url":"https://en.sharif.ir/","area":"Computer Engineering","studyType":"BSc","startDate":"2019-09-01","endDate":"2025-01-01","score":"18.96","courses":["Linear Algebra","Artificial Intelligence","Fundamentals of 3D Computer Vision","Machine Learning","Software Engineering","Database Design","Design of Programming Languages","Compilers Design"]}],"achievements":[{"title":"Ranked 17th nationally out of 164278 candidates in Nationwide Universities' Entrance Exam.","date":"2019"}],"certificates":[{"name":"CO-OP","date":"2025","issuer":"Sharif University of Technology - Computer Engineering Department",}],"publications":[{"name":"Automatic Real-time Detection of Brain Aneurysm via Multi-View YOLOv5","publisher":"Computers in Biology and Medicine","releaseDate":"Under Review"},{"name":"Automated Code Reviewer Recommendation for Pull Requests","publisher":"EISEJ"}],"projects":[{"name":"A Simulator for Edge Network and Cloud Computing Systems","summary":"My B.Sc. thesis builds upon research led by Prof. Dolati, exploring the optimization of resource usage in edge networks, as detailed in the paper \"Layer-Aware Containerized Service Orchestration in Edge Networks.\" For my thesis, I am developing a user-friendly network simulator with a graphical interface. This software tool will enable users to interact with and implement the algorithms proposed in the paper, facilitating further experimentation and validation of the research. Moreover, my work involves refining and improving these algorithms. The results of these enhancements, along with the simulator, will be published in journal and conference papers upon completion of my thesis.","startDate":"2024-09-01","endDate":"2024-11-01"}]}